{
  "status": "success",
  "totalResults": 368,
  "results": [
    {
      "title": "Government tights vigilance over fake drug manufacturers, 18 licenses cancelled",
      "link": "https://news24online.com/india/government-tights-vigilance-over-fake-drug-manufacturers-18-licenses-cancelled/114872/?utm_source=rss&utm_medium=rss&utm_campaign=government-tights-vigilance-over-fake-drug-manufacturers-18-licenses-cancelled",
      "keywords": [
        "India"
      ],
      "creator": [
        "Aditya Pratap Singh"
      ],
      "video_url": null,
      "description": "<p>New Delhi: The central government has tightened its vigilance over companies making fake medicines. In a major crackdown against manufacturing of substandard drugs, the central and state regulators conducted a joint inspection of 76 pharma companies to which 18 manufacturers were reportedly found involved in producing forge medicine. The licenses of all of them have […]</p> <p>The post <a rel=\"nofollow\" href=\"https://news24online.com/india/government-tights-vigilance-over-fake-drug-manufacturers-18-licenses-cancelled/114872/\">Government tights vigilance over fake drug manufacturers, 18 licenses cancelled</a> appeared first on <a rel=\"nofollow\" href=\"https://news24online.com\">News24 English</a>.</p>",
      "content": "The central government has tightened its vigilance over companies making fake medicines. In a major crackdown against manufacturing of substandard drugs, the central and state regulators conducted a joint inspection of 76 pharma companies to which 18 manufacturers were reportedly found involved in producing forge medicine. The licenses of all of them have been cancelled. The Drugs Controller General of India has conducted investigations in companies situated in 20 states. The search lasted for 15 days. According to information, in the first phase of the special drive against the manufacturing of substandard drugs, an investigation has been carried out against 76 companies. Licenses of 18 pharma companies were cancelled for manufacturing spurious and substandard drugs and violating Good Manufacturing Practices (GMP). In addition, show-cause notices to 26 firms have also been issued. As per sources, the regulators have identified 203 drug manufacturers as part of the special drive. Most of the companies are from Himachal Pradesh (70), Uttarakhand (45) and Madhya Pradesh (23). Recently questions have been raised about the quality of medicines manufactured by India-based companies.",
      "pubDate": "2023-03-28 15:35:35",
      "image_url": null,
      "source_id": "news24online",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    
    {
      "title": "Skoda Kushaq Onyx Edition: Price, features and much more!",
      "link": "https://news24online.com/auto/skoda-kushaq-onyx-edition-price-features-and-much-more/114775/?utm_source=rss&utm_medium=rss&utm_campaign=skoda-kushaq-onyx-edition-price-features-and-much-more",
      "keywords": [
        "Auto"
      ],
      "creator": [
        "Shriti"
      ],
      "video_url": null,
      "description": "<p>New Delhi: Skoda has launched a special version of the popular SUV Kushaq in the Indian market. It has been introduced under the name Onxy Edition. The new Kushaq SUV gets gray colored graphics on the doors, Onxy badging and chrome work on the front grille. Apart from this, 16-inch wheels with wheel covers have […]</p> <p>The post <a rel=\"nofollow\" href=\"https://news24online.com/auto/skoda-kushaq-onyx-edition-price-features-and-much-more/114775/\">Skoda Kushaq Onyx Edition: Price, features and much more!</a> appeared first on <a rel=\"nofollow\" href=\"https://news24online.com\">News24 English</a>.</p>",
      "content": "Skoda has launched a special version of the popular SUV Kushaq in the Indian market. It has been introduced under the name Onxy Edition. The new Kushaq SUV gets gray colored graphics on the doors, Onxy badging and chrome work on the front grille. Apart from this, 16-inch wheels with wheel covers have been given in the new Kushaq. The Onyx Edition of the new Skoda Kushaq sits between the Active and Ambition Classic variants. Its design parts include LED projector headlamps, fog lamps, rear fog. Talking about the interiors of the new Skoda Kushaq, there have been no significant changes in it. It looks quite similar to the standard model. The interiors of the SUV get blacked out seats, two-spoke steering wheel and chrome finishing around the AV vents. Apart from this, features like 7-inch touchscreen infotainment system, automatic climate control and height adjustable driver seat have been provided in the car. Touch pen control and air care function have been given for AC in the new Kushak. Skoda Kushaq Onyx Edition has been given a 1.0 liter turbo-petrol engine. This setup generates 114bhp power and 178Nm peak torque. Its engine is paired with a 6-speed manual gearbox. The price of Skoda Kushaq Onyx Edition starts from Rs. 12.39 lakhs. It is Rs 80,000 more expensive than the Active variant. Keep in mind that this price is according to the ex-showroom.",
      "pubDate": "2023-03-28 15:30:57",
      "image_url": null,
      "source_id": "news24online",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "The Ultimate Guide to Blockchain Technology’s Benefits and Drawbacks",
      "link": "https://www.cryptotimes.io/blockchain-technology-benefits-and-drawbacks/",
      "keywords": [
        "Articles",
        "Blockchain"
      ],
      "creator": [
        "Guest"
      ],
      "video_url": null,
      "description": "There are many blockchain believers out there who see this technology as the pinnacle of the coming digital…",
      "content": "There are many blockchain believers out there who see this technology as the pinnacle of the coming digital revolution. Honestly, they are right. Technology replaces outdated processes, eliminates middlemen, and opens up a whole new world to us. Yet, many people do not carefully balance the benefits and drawbacks of blockchain technology when they invest. All technologies have their benefits and drawbacks, and blockchain is no different. However, when companies try to maximize the potential of blockchain, they often overlook the drawbacks. This leads to a lot of wasted time and effort, as well as the unavoidable blunders that accompany it. A can help with the proper implementation of the technology and can guide you through what will be beneficial for your organization. We will discuss blockchain’s benefits and drawbacks in this article to help you with your initial decision. The most basic version of a is just a series of blocks. In this context, a chain can be considered as a digital ledger, whereas a block refers to a piece of digital data that can be accessed by anybody. Three different kinds of digital information are stored in each individual block of the blockchain: transaction data, involvement data, and unique identifiers. Blockchain has the ability to drastically change how businesses access data. Because of its distribution characteristics, weak areas are effectively eliminated in almost all cases. Because of its high stability and strict regulation, confirmed data is almost impossible to change or reverse. There is no need for data to be trusted in transactional operations since there are no intermediaries. Businesses of various sizes and in a broad range of sectors can reap the benefits of this technology. Below are the top three benefits: The blockchain often replicates data across thousands of devices. There is a distributed network consisting of these nodes. Its distribution makes the data and systems very strong. They are very resilient to malicious attacks and technological issues. Blocks that have been confirmed are very unlikely to be altered. This suggests that it is almost impossible to change or remove data from the ledger once it has been entered. So, a blockchain is an ideal tool for the safe keeping of financial, banking, medical, and other equally sensitive data. A public distributed ledger tracks and logs all changes in perpetuity. Traditional payment methods need both parties and a mediator for transactions. Banks, credit card companies, and payment solutions are intermediaries. Using this method eliminates the need for a middleman. In order to ensure the legitimacy of these trades, the distributed node network employs a method known as mining. Blockchain is thus generally viewed as a totally reliable technology. Why has blockchain not been adopted by everyone yet, considering the benefits outlined above? Every benefit has a comparable drawback. Blockchain technology is no exception. There are a few factors that might lead businesses to hesitate before taking any action. Due to the fact that its ledger is the most extensive and complex of all blockchains, Bitcoin is considered the technology’s progenitor. The that protects the blockchain’s security is called Proof of Work. It has a well-deserved reputation for being both effective and efficient. Even with all of the security protections that have been implemented, there are still ways that blockchains can be attacked. A 51 percent attack is among the most common types of damaging attacks that people talk about. The innovation behind blockchain technology is public-key cryptography, also called asymmetric cryptography. This gives access to blockchain data when combined with a private key. In the event that a user or employee misplaces or forgets their private key, the data is completely gone. The integrity and security of the whole ledger would be compromised if the private key was affected in any way. Despite the many advantages of this technology, users of Proof of Work are often ineffective. The blockchain mining market is quite competitive. This makes the work of other miners completely pointless, especially considering there is only ever one “winner” in a given time period. Blockchain technology has several business applications despite its considerable drawbacks. It still has a long way to go before the adoption becomes widespread. Despite this, several large companies have already invested heavily in blockchain integration.",
      "pubDate": "2023-03-28 14:38:00",
      "image_url": null,
      "source_id": "cryptotimes",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Disney closes its Metaverse Division as part of their Layoffs Plan",
      "link": "https://www.cryptotimes.io/disney-closes-its-metaverse-division-as-part-of-their-layoffs-plan/",
      "keywords": [
        "Metaverse",
        "News",
        "Disney"
      ],
      "creator": [
        "Dhara Chavda"
      ],
      "video_url": null,
      "description": "The closure of Disney's Metaverse division is part of a larger strategy to streamline the operations and focus on its core strengths in content creation and distribution.",
      "content": "According to the WSJ , Disney has shut down its Metaverse division as part of a strategy to lay off thousands of workers across its theme park, cruise line, and retail companies. The company will further reduce headcount by around 7000 over the next two months. Disney’s next-generation storytelling and consumer experiences unit, the small division that was developing metaverse strategies, looks like it’s one of the first to go. The metaverse division is headed by Mike White, who was promoted to the role from SVP of consumer experiences and platforms in February 2022 and charged with getting Disney deeper into the web3 space. The unit aimed to find ways to tell more interactive stories in immersive formats using Disney’s extensive library of intellectual property, according to WSJ. All 50 or so members of the team have lost their jobs, sources told WSJ. White will remain at the company, but it’s not clear in what capacity. The Metaverse division was a new effort devoted to researching virtual reality and other immersive digital experiences. The decision to close the Metaverse division comes after Disney revealed plans in October 2020 to restructure its media and entertainment divisions to focus more on streaming and direct-to-consumer programming. As part of this reorganization, the firm established a new business, Media and Entertainment Distribution, to supervise its streaming services, which include Disney+, Hulu, and ESPN+. While the closure of Disney’s Metaverse division may be disappointing to those interested in the company’s exploration of virtual reality and immersive digital experiences, it appears to be part of a larger strategy to streamline the company’s operations and focus on its core strengths in content creation and distribution.",
      "pubDate": "2023-03-28 13:24:00",
      "image_url": null,
      "source_id": "cryptotimes",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Ben Stokes To Play As Specialist Batter At Start Of IPL 2023- Report",
      "link": "https://www.thetimesofbengal.com/sports/ben-stokes-to-play-as-specialist-batter-at-start-of-ipl-2023-report/",
      "keywords": [
        "Sports"
      ],
      "creator": [
        "admin"
      ],
      "video_url": null,
      "description": "Home Sports Ben Stokes To Play As Specialist Batter At Start Of IPL 2023- Report The star allrounder, who was picked by the four-time IPL champions for Rs. 16.25 crore during the auction held in December last year, arrived in India last week and has been training for the upcoming season starting March 31. Ben […]",
      "content": "Mumbai, Mar 28: England Test captain Ben Stokes will be available only as a specialist batter for Chennai in the early stages of the Indian Premier League 2023. The star allrounder, who was picked by the four-time IPL champions for Rs. 16.25 crore during the auction held in December last year, arrived in India last week and has been training for the upcoming season starting March 31. A report in ESPNCricinfo said, Stokes, who has played for Rajasthan Royals and Rising Pune Supergiant in the past, will likely play as a specialist batter initially to manage his knee injury, for which he has taken a cortisone injection — an anti-inflammation medicine. The 31-year-old has been hampered by recurring injuries to his left knee, with the most recent flare-up happening during England’s tour of New Zealand. Stokes bowled only nine overs across two Tests and batted with a lot of discomfort on the final day of the second Test in Wellington. Terming the injury “very frustrating”, Stokes said he hoped to “get into a position that I feel like I don’t have to worry about my knee anymore” with England set to host Australia for the Ashes this year in June. CSK batting coach Michael Hussey confirmed Stokes might not bowl at the start of the IPL. “My understanding is he’s ready to go as a batsman from the start. The bowling might be wait and see. I know he had his first very light bowl yesterday (Sunday) since he had his injections in his knee,” said Hussey. “The physios from Chennai (CSK) and ECB (England and Wales Cricket Board) are working pretty closely together. My understanding is he won’t be bowling much at all in the first few games of the tournament… it might be a few weeks. I’m not 100% sure, (but we will) hopefully get him bowling at some stage in the tournament,” Hussey added. With the home-and-away format returning in IPL 2023, CSK are set to play in front of their fans at the Chinnaswamy Stadium. Hussey hoped the setup brings the best out of Stokes. “The ground is amazing: new stands up, full capacity. The first home game, the atmosphere is going to be out of this world. I can’t wait — and I’m sure Stokesy is going to absolutely love it. That’s the thing with those big players, they generally like a big stage and perform their best on it. Once he gets out there in Chepauk Stadium in front of an unbelievably loud crowd, I hope it’s going to bring out the best in him,” Hussey said. Hussey added that Stokes had been “hitting the ball really well” since arriving in India, predicting that he would be “huge” to the franchise’s bid to reach the playoffs, “particularly if we can get him bowling… having those allrounders is really important.” Source link",
      "pubDate": "2023-03-28 12:56:52",
      "image_url": null,
      "source_id": "the_tob",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Generating spatially structured electron spins using a structured light",
      "link": "https://www.techexplorist.com/generating-spatially-structured-electron-spins-using-structured-light/58131/?utm_source=rss&utm_medium=rss&utm_campaign=generating-spatially-structured-electron-spins-using-structured-light",
      "keywords": [
        "Science",
        "Electrons",
        "Spins"
      ],
      "creator": [
        "Pranjal Mehar"
      ],
      "video_url": null,
      "description": "Storing information with spins. Continue reading Generating spatially structured electron spins using a structured light on Tech Explorist.",
      "content": null,
      "pubDate": "2023-03-28 12:46:30",
      "image_url": null,
      "source_id": "techexplorist",
      "category": [
        "science"
      ],
      "country": [
        "india",
        "singapore"
      ],
      "language": "english"
    },
    {
      "title": "QuestGPT Shines During ETHDenver 2023 [Project Spotlight]",
      "link": "https://www.cryptonewsz.com/questgpt-shines-during-ethdenver-2023/",
      "keywords": [
        "Cryptocurrency",
        "Cryptocurrency News"
      ],
      "creator": [
        "Mark Peterson"
      ],
      "video_url": null,
      "description": "ETHDenver, the largest Ethereum ecosystem conference, concluded last Sunday with the hackathon finalists presenting their builds to an enthusiastic crowd at Denver’s National Western Complex. The conference attracted over 20,000 attendees, lasted two weeks, and included programming, hacker houses, parties, and panels throughout Denver. By the time of the closing ceremonies, hundreds of developers had …",
      "content": ", the largest Ethereum ecosystem conference, concluded last Sunday with the hackathon finalists presenting their builds to an enthusiastic crowd at Denver’s National Western Complex. The conference attracted over 20,000 attendees, lasted two weeks, and included programming, hacker houses, parties, and panels throughout Denver. By the time of the closing ceremonies, hundreds of developers had gathered at ETHDenver’s main stage to cheer on their favorite #BUIDLathon projects. One curious project that caught the attention of many attendees was , a project that fuses the ChatGPT utility with Community engagement elements, gamifying engagement, and interaction. The QuestGPT team had only met the day before the hackathon and had a small part of the project vision in mind. However, the collaborative spirit at ETHDenver helped create an atmosphere where other builders and developers eagerly lined up to test the tool, give feedback, and pitch their own ideas for what should be the focus of the project. – , Team QuestGPT Before the main event of ETHDenver even began, QuestGPT had over 100 users testing and interacting with their tool in an alpha testing environment. The excitement surrounding the small project continued to grow as several builders went out of their way to tweet and record videos about the project, further demonstrating the culture of collaboration and support at ETHDenver. Thanks to its base of developer fans, QuestGPT continued to grow and improve. By the time of the main event, the team had amassed a large amount of user data and had released a new polished version of their alpha. The latest version included created and airdropped to the user at the end of their story based on the events of their game. While collaboration and ecosystem building were emphasized at ETHDenver, QuestGPT Team’s hustle is what really stood out. Possibly being one of the only groups to use a traditional approach by printing out posters and postcards, the QuestGPT team attracted even more attendees eager to test their five-day-old project and provide feedback on how it could be improved. Thanks to the determination of the QuestGPT team, support from their fellow , and the excitement from ETHDenver attendees, the project attracted over 300 users in just six days. Their API was hit over 5500 times, and their alpha boasted equally impressive discord engagement stats. It was evident that QuestGPT had something unique, and with a large group of dedicated fans, the team worked hard to deliver a high-quality product by the event’s end. The final day of the ETHDenver hackathon was busy and exciting, with a flurry of activity typical of such a community-driven event. Despite the chaos, the QuestGPT team continued to push out updates, impressing attendees with new art styles for their generative NFTs and leading their user base to create nearly 100 new NFTs, continuing even after the event had officially ended. It comes as no surprise that QuestGPT won ETHDenver through main prize bounty for and was selected for their new marketplace. Given their enthusiastic web3 community, AI’s growing momentum, and even an upcoming release of a new D&D movie, QuestGPT looks to be in a strong position to leverage its success at one of the world’s largest events. I even played it myself and got to experience its engaging power firsthand, finding it both enjoyable and addictive. It’s no small feat to make a single-player experience on Discord entertaining, but QuestGPT managed to strike the perfect balance. You can try it out for yourself in their . Overall, the event demonstrated the power of collaboration, innovation, and community in the Ethereum ecosystem and provided a platform for budding entrepreneurs to showcase their talent and ideas. It’s exciting to see what the future holds for QuestGPT, especially in the realm of AI and blockchain technology, where the fusion of whimsy and real-world value can be a game-changer.",
      "pubDate": "2023-03-28 12:38:45",
      "image_url": null,
      "source_id": "cryptonewsz",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Trojan terror! Trojan targets 450 apps on Google Play Store, says report",
      "link": "https://tech.hindustantimes.com/tech/news/trojan-terror-trojan-targets-450-apps-on-google-play-store-says-report-71680003700597.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "A new Android trojan app has emerged that could take over your bank account and empty it of all your money.",
      "content": "Just days after it was revealed that Xenomorph Android malware has made a comeback, another Android Trojan threat has emerged and although it isn't fully developed yet, it could still lead to disastrous consequences for people around the world. It has been injected into the Google Play Store ecosystem. Google Play Store offers millions of apps for Android users for any and all tasks. Despite Google's attempts, some potentially harmful apps slip through without being detected. The latest Trojan that has created big problems is known as Nexus and it is capable of targeting almost 450 apps on the Google Play Store. What is Nexus? According to a report by Cleafy, Nexus first appeared on multiple hacking forums back in January 2023. It is being distributed through phishing pages disguised as legitimate websites of YouTube Vanced, a modified version of YouTube, according to threat intelligence firm Cyble . The trojan is capable of stealing passwords from banking applications and can intercept both 2FA codes received through text messages, as well as codes generated by the Google Authenticator app. Although Nexus is still in its developmental stages, it is already capable of causing major harm. Nexus has been introduced on a ‘Malware-as-a-Service' platform where hackers pay other cybercriminals to access their service. How does it work? Nexus takes over a bank account by initiating overlay attacks which involves putting an overlay or a fake version on top of a legitimate banking app. When users log in to their accounts, the overlay captures their username and password. Additionally, Nexus has a keylogger that can capture any passwords a user types or autofills on their phone. Moreover, the latest version of Nexus has the ability to delete text messages received on the infected device, halt its 2FA stealing feature, as well as update itself regularly by pinging a cybercriminal-controlled command-and-control (C&C) server. How you can stay safe There are various ways you can stay safe from malicious malware to keep all your banking information away from the hands of cybercriminals and hackers. 1. NEVER download and install apps from unknown sources. Use only Google Play Store to install apps. 2. Never download any apps from third-party app stores. 3. Do not open any links from any of the text messages you receive. Banks never ask customers to install any app from a given link. 4. Install antivirus and antimalware software on your smartphone to keep it safe from any potential malware.",
      "pubDate": "2023-03-28 12:31:22",
      "image_url": "https://images.hindustantimes.com/tech/img/2023/03/28/1600x900/cyber-4444448_640_1680006621421_1680006629508_1680006629508.jpg",
      "source_id": "hindustantimes_tech",
      "category": [
        "technology"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Sebi Recovers Rs 6.57 Cr From Sahara Group Firms, Subrata Roy And Others",
      "link": "https://www.news18.com/business/sebi-recovers-rs-6-57-cr-from-sahara-group-firms-subrata-roy-and-others-7406191.html",
      "keywords": [
        "business"
      ],
      "creator": null,
      "video_url": null,
      "description": "The recovery proceedings were initiated against these entities after they failed to pay Rs 6 crore fine imposed on them by Sebi in June 2022.",
      "content": "Markets regulator Sebi on Tuesday said it has recovered pending dues worth Rs 6.57 crore from Sahara India Real Estate Corporation, its chief Subrata Roy, and others in the case pertaining to flouting norms in issuance of optionally fully convertible debentures. “In view of the payment of the amount of Rs 6.57 crore due under the certificate, the said certificate is hereby completed,\" the Securities and Exchange Board of India (Sebi) said in its recovery order. The amount included interest and other charges. The regulator in December ordered the attachment of bank and demat accounts of Sahara India Real Estate Corporation (now known as Sahara Commodity Services Corporation), Subrata Roy, Ashok Roy Choudhary, Ravi Shanker Dubey and Vandana Bharrgava to recover Rs 6.42 crore for violating regulatory norms in the issuance of OFCDs (Optionally Fully Convertible Debentures). This amount included interest, all costs, charges and expenses. The recovery proceedings were initiated against these entities after they failed to pay Rs 6 crore fine imposed on them by Sebi in June 2022. The case relates to the issuance of OFCDs by Sahara India Real Estate Corporation and Sahara Housing Investment Corporation during 2008-09. The companies raised money through the public issue of securities by issuing OFCDs without following the various procedures intended to protect the interest of the investors, in respect of public issues, prescribed under the norms. According to Sebi, the subscription towards the OFCDs was solicited by the two companies from the general public throughout the country, without adequately informing them about the risks involved in the instruments. The issuance was allegedly done in contravention of the provisions of the Sebi’s ICDR (Issue of Capital and Disclosure Requirements) Regulations and PFUTP (Prohibition of Fraudulent and Unfair Trade Practices). Read all the Latest Business News here",
      "pubDate": "2023-03-28 12:05:07",
      "image_url": "https://images.news18.com/ibnlive/uploads/2023/03/sebi-1200-2-16800047713x2.png",
      "source_id": "news18",
      "category": [
        "business"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    },
    {
      "title": "Wombat Exchange to launch on Arbitrum on 5 April",
      "link": "https://www.cryptonewsz.com/wombat-exchange-to-launch-on-arbitrum-on-5-april/",
      "keywords": [
        "Exchange",
        "Cryptocurrency Exchange News"
      ],
      "creator": [
        "David Cox"
      ],
      "video_url": null,
      "description": "Wombat Exchange, the next-generation stable swap exchange, proudly announced its launch on Arbitrum One, the leading Ethereum layer-2 network. This launch will take place on 5 April 2023 at 6 am UTC. The new venture of Wombat Exchange intends to increase accessibility, efficiency, and scalability in the multichain territory. The association of Wombat Exchange and …",
      "content": "Wombat Exchange, the next-generation stable swap exchange, proudly announced its launch on Arbitrum One, the leading Ethereum layer-2 network. This launch will take place on 5 April 2023 at 6 am UTC. The new venture of Wombat Exchange intends to increase accessibility, efficiency, and scalability in the multichain territory. The association of Wombat Exchange and the Arbitrum blockchain shares a common vision and will work together to provide an exceptional stablecoin swapping experience to all Arbinauts. These stablecoins can now be swapped with minimum slippage and offer single-sided liquidity. Wombat is bringing the entire Wombat ecosystem with the multichain expansion that includes the platforms like Quoll Finance, Wombex Finance, and Magpie XYZ to Arbitrum. This force will contribute to adding liquidity pools and creating new opportunities for users. The users can now stake their assets in exchange for rewards. Furthermore, this move marks an essential step of innovation within the world of DeFi. Wombat’s move to deploy on Arbitrum demonstrates a thrilling step taken to revolutionize the DeFi world. The Wombat Exchange community is excited to make themselves a leading multichain stable swap. They promise to deliver a seamless stable swap experience to their customers so that they can select Wombat Exchange as their favorite DeFi platform.",
      "pubDate": "2023-03-28 11:00:21",
      "image_url": null,
      "source_id": "cryptonewsz",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    }
  ],
  "nextPage": "1680001221561cd7856cc4565ba6e011c522322a79"
}